app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."facebook_id" = $1 LIMIT 1  [["facebook_id", "1729550923945849"]]
INSERT INTO "users" ("first_name", "last_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["first_name", "Jon"], ["last_name", "Rose"], ["created_at", "2016-01-24 02:28:15.646866"], ["updated_at", "2016-01-24 02:28:15.646866"]]
---
  def login
    @facebook_id = params[:facebook_id]
    @user = User.find_by(facebook_id: @facebook_id)
    if @user
      current_user = @user
      redirect_to @user
    else
      @user = User.new
      @user.name= params[:name]
      @user.save